content-org/o.org
:PROPERTIES:
:EXPORT_DATE: [2018-11-11 Mon 21:49]
:END:

* Changelog
:PROPERTIES:
:EXPORT_FILE_NAME: changelog
:EXPORT_HUGO_SECTION: docs/updates
:END:
** 2022
*** June
- Started working on the homepage
*** July
- Finished the structure of the homepage. Filling in manual contents
- I have to finish this homepage today no matter what.
- I did not finish it on 15th. It took another couple of days.
- I finished the other sites in locus, re-touching on minor tweaks in the homepage. Hopefully from tomorrow I'll be able to follow on my agenda. Yay! 🎊
*** October
- Updated both primary and secondary toolchest to be updated dynamically from an airtable base. It's so much better now.
- Added Syllabi page
*** November
- Added notes about how to manage work and study and day to day activities in /day
- Updated Food and Drink page with exercise and diet plan details
- Added Hire page
** 2023
*** January
- Toolchest pages are now better generated
*** February
- Added experiments page
- Added homelab page
*** May
- Added Snipes page to add things I am curious about
