content/docs/updates/changelog.md
+++
title = "Changelog"
author = ["Hrishikesh Barman"]
date = 2018-11-11T21:49:00+05:30
draft = false
+++

## 2022 {#2022}


### June {#june}

-   Started working on the homepage


### July {#july}

-   Finished the structure of the homepage. Filling in manual contents
-   I have to finish this homepage today no matter what.
-   I did not finish it on 15th. It took another couple of days.
-   I finished the other sites in locus, re-touching on minor tweaks in the homepage. Hopefully from tomorrow I'll be able to follow on my agenda. Yay! 🎊


### October {#october}

-   Updated both primary and secondary toolchest to be updated dynamically from an airtable base. It's so much better now.
-   Added Syllabi page


### November {#november}

-   Added notes about how to manage work and study and day to day activities in /day
-   Updated Food and Drink page with exercise and diet plan details
-   Added Hire page


## 2023 {#2023}


### January {#january}

-   Toolchest pages are now better generated


### February {#february}

-   Added experiments page
-   Added homelab page


### May {#may}

-   Added Snipes page to add things I am curious about
